Public Attributes | List of all members
ACAPI::MEP::DuctTransitionPreferenceTable::Key Struct Reference
MEP Element Manager
The key that uniquely identifies a row in the DuctTransitionPreferenceTable. More...
#include <MEPDuctTransitionPreferenceTable.hpp>
 Public Attributes
 uint32_t  | beginReferenceId
The begin referenceId of the row. The table only contains the referenceIds that are defined in the DuctReferenceSet.
 uint32_t  | endReferenceId
The end referenceId of the row. The table only contains the referenceIds that are defined in the DuctReferenceSet.
Detailed Description
The key that uniquely identifies a row in the DuctTransitionPreferenceTable.
Since
Archicad 29